void showMenu();
void showSkills()
{
	cout << "0:返回"<<endl;
	while(S()!=0)
	{
		//cout << "0:返回";<<endl;
	}
	showMenu();
	return;
}

void showHelps()
{
	cout << "1:基本牌 2:锦囊牌 3:装备牌 "<<endl;/*4:武将*/
	int choose = S();
	switch(choose)
	{
	case 1:
		{
			cout << "1:杀"<<endl;
			cout << "2:闪"<<endl;
			cout << "3:桃"<<endl;
			choose = S();
			switch(choose)
			{
			case 1:
				{
					//cout << left;
					cout << "--------------------------------------------------------------------" << endl;
					cout << setw(12) << "出牌时机" << setw(12) << "|" << setw(12) << "出牌阶段。"<< endl;
					cout << setw(12) << "使用目标" << setw(12) << "|" << setw(12) << "你攻击范围内的一名其他角色。"<< endl;
					cout << setw(12) << "作用效果" << setw(12) << "|" << setw(12) << "你对目标角色造成1点伤害。"<< endl;
					cout << "--------------------------------------------------------------------" << endl;
					cout << setw(12) << "备注" << setw(12) << endl;
					cout << "★游戏初始攻击范围是1 。" << endl;
					cout << "★每个出牌阶段你只能使用一张【杀】。" << endl;
					cout << "★响应锦囊牌【借刀杀人】时，可使用【杀】。" << endl;
					cout << "★响应锦囊牌【决斗】时，可打出【杀】。" << endl;
					cout << "★响应锦囊牌【南蛮入侵】时，可打出【杀】。" << endl;
					cout << "★响应武将技能，如刘备“激将”时，可使用或打出【杀】。" << endl;
					cout << "--------------------------------------------------------------------" << endl;
					break;
				}
			case 2:
				{
					//cout << left;
					cout << "--------------------------------------------------------------------" << endl;
					cout << setw(12) << "出牌时机" << setw(12) << "|" << setw(12) << "以你为目标的【杀】开始结算时（即【杀】生效前）。"<< endl;
					cout << setw(12) << "使用目标" << setw(12) << "|" << setw(12) << "以你为目标的【杀】。"<< endl;
					cout << setw(12) << "作用效果" << setw(12) << "|" << setw(12) << "抵消目标【杀】对你产生的效果。"<< endl;
					cout << "--------------------------------------------------------------------" << endl;
					cout << setw(12) << "备注" << setw(12) << endl;
					cout << "★【闪】通常情况下只能在回合外使用或打出。" << endl;
					cout << "★响应锦囊【万箭齐发】时，可打出【闪】。" << endl;
					cout << "★响应武将技能，如曹操“护驾” 时，可打出【闪】。" << endl;
					cout << "--------------------------------------------------------------------" << endl;
					break;
				}
			case 3:
				{
					//cout << left;
					cout << "--------------------------------------------------------------------" << endl;
					cout << setw(12) << "出牌时机" << setw(12) << "|" << setw(12) << "出牌阶段。当一名角色处于濒死状态时。"<< endl;
					cout << setw(12) << "使用目标" << setw(12) << "|" << setw(12) << "已受伤的你。该角色。"<< endl;
					cout << setw(12) << "作用效果" << setw(12) << "|" << setw(12) << "你回复1点体力。该角色回复1点体力。"<< endl;
					cout << "--------------------------------------------------------------------" << endl;
					cout << setw(12) << "备注" << setw(12) << endl;
					cout << "★例如，一名角色的剩余体力为2点，此时受到【闪电】造成的3点伤害，此时该角色处于濒死状态，该角色或其他任何人合计需使用2张【桃】才能救回（2-3+2=1）。" << endl;
					cout << "★出牌阶段，若你没有损失体力，你不可以对自己使用【桃】。" << endl;
					cout << "--------------------------------------------------------------------" << endl;
					break;
				}

			}
			break;
		}//end of case 1

	case 2://锦囊牌
		{
			cout <<"锦囊牌代表了可以使用的各种“锦囊妙计”，每张锦囊上会标有【锦囊】字样。锦囊分为两类，标有沙漏记号的叫“延时类锦囊”。使用延时类锦囊牌只需将它置入目标角色的判定区即可，不会立即进行使用结算，而是要到目标角色下回合的判定阶段进行。判定区里有延时类锦囊牌的角色不能被选择为同名的延时类锦囊牌的目标。除此之外的锦囊为“非延时类锦囊”。"<<endl;
	        cout << "--------------------------------------------------------------------" << endl;
			cout << setw(12) << "锦囊" << setw(12) << "|" << setw(12) << "卡牌说明"<< endl;
			cout << setw(12) << "决斗" << setw(12) << "|" << setw(12) << "出牌阶段，对一名其他角色使用。由其开始，其与你轮流打出一张【杀】，直到其中一方未打出【杀】为止。未打出【杀】的一方受到另一方对其造成的1点伤害。"<< endl;
			cout << setw(12) << "过河拆桥" << setw(12) << "|" << setw(12) << "出牌阶段，对区域里有牌的一名其他角色使用。你弃置其区域里的一张牌。"<< endl;
			cout << setw(12) << "顺手牵羊" << setw(12) << "|" << setw(12) << "出牌阶段，对距离为1且区域里有牌的一名其他角色使用。你获得其区域里的一张牌。"<< endl;
			cout << setw(12) << "无中生有" << setw(12) << "|" << setw(12) << "出牌阶段，对你使用。你摸两张牌。"<< endl;
			cout << setw(12) << "借刀杀人" << setw(12) << "|" << setw(12) << "出牌阶段，对装备区里有武器牌且其攻击范围内有使用【杀】的目标的一名其他角色A使用。（选择目标时）你选择A攻击范围内的另一名角色B。A需对B使用一张【杀】，否则将其装备区里的武器牌交给你。"<< endl;
			cout << setw(12) << "无懈可击" << setw(12) << "|" << setw(12) << "一张锦囊牌生效前，对此牌使用。抵消此牌对一名角色产生的效果，或抵消另一张【无懈可击】产生的效果。"<< endl;
			cout << setw(12) << "南蛮入侵" << setw(12) << "|" << setw(12) << "出牌阶段，对所有其他角色使用。每名目标角色需打出一张【杀】，否则受到1点伤害。"<< endl;
			cout << setw(12) << "万箭齐发" << setw(12) << "|" << setw(12) << "出牌阶段，对所有其他角色使用。每名目标角色需打出一张【闪】，否则受到1点伤害。"<< endl;
			cout << setw(12) << "桃园结义" << setw(12) << "|" << setw(12) << "出牌阶段，对所有角色使用。每名目标角色回复1点体力。"<< endl;
			cout << setw(12) << "五谷丰登" << setw(12) << "|" << setw(12) << "出牌阶段，对所有角色使用。（选择目标后）你从牌堆顶亮出等同于角色数量的牌，每名目标角色获得这些牌中（剩余的）的任意一张。"<< endl;
			cout << setw(12) << "乐不思蜀（延时类锦囊）" << setw(12) << "|" << setw(12) << "出牌阶段，对一名其他角色使用。若判定结果不为红桃，跳过其出牌阶段。"<< endl;
			cout << setw(12) << "闪电（延时类锦囊）" << setw(12) << "|" << setw(12) << "出牌阶段，对你（你是第一个目标，之后可能会不断改变）使用。若判定结果为黑桃2~9，则目标角色受到3点雷电伤害。若判定不为黑桃2~9，将之移动到其下家的判定区里。"<< endl;
			cout << "--------------------------------------------------------------------" << endl;
			break;
		}//end of case 2

	case 3://装备牌
		{
			cout << "装备牌需放置于装备区里，它们在使用后就会一直放在该区域（而不是像基本牌或锦囊一样进入弃牌堆。）装备牌的效果为持续性效果，即一旦使用后（装备着）则会一直生效。[9]"<<endl;
			cout << "1:武器：武器牌能增强攻击能力，装备区里只能摆放一张武器牌，若想变更武器，必须将原来的武器弃置，然后使用新的武器来替代。"<<endl;
			cout << "2:坐骑：可以在装备区里放置一张+1坐骑和一张－1坐骑（不论是何名称），但不可以放置两张－1坐骑或两张+1坐骑（尽管名称不同）。"<<endl;
			cout << "3:防具：防具是可以增强防御力的装备，装备区里始终只能放有一张防具牌。"<<endl;
			choose = S();
			switch(choose)
			{
			case 1:
				{
					//cout << left;
					cout << "--------------------------------------------------------------------" << endl;
					cout << setw(12) << "武器" << setw(12) << "|" << setw(12) << "攻击范围"<< setw(12) << "|" << setw(12) << "技能" << endl;
					cout << setw(12) << "诸葛连弩" << setw(12) << "|" << setw(12) << "1"<< setw(12) << "锁定技，你于出牌阶段内使用【杀】无次数限制。" << endl;
					cout << setw(12) << "青釭剑" << setw(12) << "|" << setw(12) << "2"<< setw(12) << "锁定技，每当你使用【杀】指定一名目标角色后，你无视其防具。" << endl;
					cout << setw(12) << "雌雄双股剑" << setw(12) << "|" << setw(12) << "2"<< setw(12) << "每当你使用【杀】指定一名异性的目标角色后，你可以令其选择一项：1.弃置一张手牌；2.令你摸一张牌。" << endl;
					cout << setw(12) << "贯石斧" << setw(12) << "|" << setw(12) << "3"<< setw(12) << "每当你使用的【杀】被目标角色使用的【闪】抵消时，你可以弃置两张牌，令此【杀】依然对其造成伤害。" << endl;
					cout << setw(12) << "青龙偃月刀" << setw(12) << "|" << setw(12) << "3"<< setw(12) << "每当你使用的【杀】被目标角色使用的【闪】抵消时，你可以对其使用一张【杀】（无距离限制）。如果有足够的【杀】，可以一直追杀下去，直到目标角色不使用【闪】为止。" << endl;
					cout << setw(12) << "丈八蛇矛" << setw(12) << "|" << setw(12) << "3"<< setw(12) << "你可以将两张手牌当【杀】使用或打出。" << endl;
					cout << setw(12) << "方天画戟" << setw(12) << "|" << setw(12) << "4"<< setw(12) << "你使用的【杀】若是你最后的手牌，你可以额外选择至多两个目标。" << endl;
					cout << setw(12) << "麒麟弓" << setw(12) << "|" << setw(12) << "5"<< setw(12) << "每当你使用【杀】对目标角色造成伤害时，你可以弃置其装备区里的一张坐骑牌。" << endl;
					cout << "--------------------------------------------------------------------" << endl;

					break;
				}
			case 2:
				{
					//cout << left;
					cout << "--------------------------------------------------------------------" << endl;
					cout << setw(12) << "类型" << setw(12) << "|" << setw(12) << "效果"<< setw(12) << "|" << setw(12) << "卡牌"<< endl;
					cout << setw(12) << "-1坐骑" << setw(12) << "|" << setw(12) << "锁定技，你与其他角色的距离-1。（可以理解为一种进攻上的优势）不同名称的－1坐骑，其效果是相同的。"<< setw(12) << "|" << setw(12) << "赤兔（黑桃5） 紫骍（方片K） 大宛（黑桃K）"<< endl;
					cout << setw(12) << "+1坐骑" << setw(12) << "|" << setw(12) << "锁定技，其他角色与你的距离+1。（可以理解为一种防御上的优势）不同名称的+1坐骑，其效果是相同的。"<< setw(12) << "|" << setw(12) << "爪黄飞电（红桃K） 的卢（梅花5） 绝影（黑桃5）"<< endl;
					cout << "--------------------------------------------------------------------" << endl;
					break;
				}
			case 3:
				{
					//cout << left;
					cout << "--------------------------------------------------------------------" << endl;
					cout << setw(12) << "防具" << setw(12) << "|" << setw(12) << "装备效果"<< endl;
					cout << setw(12) << "八卦阵(黑桃2/梅花2)" << setw(12) << "|" << setw(12) << "每当你需要使用或打出一张【闪】时，你可以进行一次判定，若判定结果为红色，视为你使用或打出了一张【闪】。"<< endl;
					cout << "--------------------------------------------------------------------" << endl;
					break;
				}

			}
			break;
		}//end of case 3
		break;
		case 4://武将
		{
			cout << "1:魏势力"<<endl;
			cout << "2:蜀势力"<<endl;
			cout << "3:吴势力"<<endl;
			cout << "3:群雄势力"<<endl;
			choose = S();
			switch(choose)
			{
			case 1:
				{
					cout << "--------------------------------------------------------------------" << endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "【曹操】" << setw(12) << "|" << setw(12) << "4"<< setw(12) << "|" << setw(12) << "魏武帝" << setw(12) << "|" << setw(12) << "奸雄：每当你受到一次伤害后，你可以获得对你造成伤害的牌。护驾：主公技，每当你需要使用或打出一张【闪】时，你可令其他魏势力角色选择是否打出一张【闪】（视为由你使用或打出）。"<<endl;
					cout << setw(12) << "【司马懿】" << setw(12) << "|" << setw(12) << "3"<< setw(12) << "|" << setw(12) << "狼顾之鬼" << setw(12) << "|" << setw(12) << "反馈：每当你受到一次伤害后，你可以获得伤害来源的一张牌。鬼才：每当一名角色的判定牌生效前，你可以打出一张手牌代替之。"<<endl;
					cout << setw(12) << "【夏侯惇】" << setw(12) << "|" << setw(12) << "4"<< setw(12) << "|" << setw(12) << "独眼的罗刹" << setw(12) << "|" << setw(12) << "刚烈：每当你受到一次伤害后，你可以进行一次判定，若判定结果不为红桃，伤害来源选择一项：1.弃置两张手牌；2.受到你对其造成的1点伤害。"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << "--------------------------------------------------------------------" << endl;
					break;
				}
			case 2:
				{
					cout << "--------------------------------------------------------------------" << endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << "--------------------------------------------------------------------" << endl;
					break;
				}
			case 3:
				{
					cout << "--------------------------------------------------------------------" << endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << "--------------------------------------------------------------------" << endl;
					break;
				}
			case 4:
				{
					cout << "--------------------------------------------------------------------" << endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << setw(12) << "武将" << setw(12) << "|" << setw(12) << "体力上限"<< setw(12) << "|" << setw(12) << "武将称号" << setw(12) << "|" << setw(12) << "技能"<<endl;
					cout << "--------------------------------------------------------------------" << endl;
					break;
				}
			}
		}
	}//end of switch
	showMenu();
	return;
}

void showMenu()
{
	cout << "1:出牌 2:帮助"<<endl;
	int choose = S();
	switch(choose)
	{
	case 1:break;
	//case 2:showSkills();break;
	case 2:showHelps();break;
	default: showMenu();
	}
	return;
}

